КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыПоказанийТоплива/КонтурЛогистика_ТипыПоказанийТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыПоказанийТоплива</name>
  <enumValues>
    <name>НаЗаезде</name>
  </enumValues>
  <enumValues>
    <name>НаВыезде</name>
  </enumValues>
  <enumValues>
    <name>Заправка</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonForms/КонтурЛогистика_Заправки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВходныеДанные = Неопределено;
	Параметры.Свойство("СписокОснований", ВходныеДанные);
	
	Если ВходныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеФормы(ВходныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СписокОснований.Количество() = 0 Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаправки

&НаКлиенте
Процедура ЗаправкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Заправки.Получить(ВыбраннаяСтрока);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущаяСтрока.ПутевойЛист);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеФормы(ВходныеДанные)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВходныеДанные", ВходныеДанные);
	Запрос.УстановитьПараметр("ТипДанных", РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ГСМ);
	Запрос.УстановитьПараметр("Разрез2", Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.Заправка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка КАК Титул1
	|ПОМЕСТИТЬ Титулы1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул1 КАК КонтурЛогистика_ПЛ_Титул1
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул1.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул3.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул3 КАК КонтурЛогистика_ПЛ_Титул3
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул3.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул4.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул4 КАК КонтурЛогистика_ПЛ_Титул4
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул4.Ссылка В(&ВходныеДанные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЛ_Титул5.Титул1
	|ИЗ
	|	Документ.КонтурЛогистика_ПЛ_Титул5 КАК КонтурЛогистика_ПЛ_Титул5
	|ГДЕ
	|	КонтурЛогистика_ПЛ_Титул5.Ссылка В(&ВходныеДанные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Титулы1.Титул1 КАК ПутевойЛист,
	|	СУММА(КонтурЛогистика_ПроизвольныеДанные.Количество) КАК Количество,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1 КАК ГорючеСмазочныеМатериалы,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3 КАК ИдентификаторЗаправки
	|ИЗ
	|	Титулы1 КАК Титулы1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|		ПО Титулы1.Титул1.kl_id = КонтурЛогистика_ПроизвольныеДанные.Разрез1
	|			И (КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных)
	|			И (КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2)
	|
	|СГРУППИРОВАТЬ ПО
	|	Титулы1.Титул1,
	|	КонтурЛогистика_ПроизвольныеДанные.Разрез3,
	|	КонтурЛогистика_ПроизвольныеДанные.Реквизит1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПутевойЛист,
	|	ГорючеСмазочныеМатериалы";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Заправки.Загрузить(Результат);
	
	СписокОснований.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("ПутевойЛист"));
	
	ИтогоТоплива = Заправки.Итог("Количество");
	
КонецПроцедуры

#КонецОбласти
